{
    "version": "1.0",
    "text": "Welcome to Cookly, developed and operated by Avery442. By accessing or using Cookly, you agree to comply with and be bound by these Terms of Service (\"Terms\"). If you do not agree with these Terms, please do not use the App. Please read these Terms carefully before using Cookly.\n\n1. Use of the App\nCookly provides a platform where users can generate recipes through artificial intelligence (\"AI\"). By using this App, you acknowledge that you are solely responsible for any decisions you make regarding the use of the recipes generated by Cookly, including ingredients, cooking techniques, and the preparation of meals.\n\n2. Disclaimer of Liability\nCookly and the AI-generated recipes it provides are intended for informational and entertainment purposes only. While the App uses sophisticated AI technology to generate recipes, we cannot guarantee the accuracy, safety, or suitability of any recipe provided.\n\n- Health Risks: You understand that the recipes generated by Cookly may contain ingredients that could cause allergies, intolerances, or other health issues. You are fully responsible for reviewing ingredients and ensuring they are safe for your consumption. Cookly is not responsible for any health issues, adverse reactions, or injuries that may occur from using or consuming any recipes generated by the App.\n\n- Damages and Risks: Cookly is not responsible for any damages, losses, or liabilities, including but not limited to, property damage, personal injury, or financial loss, that arise from your use of the App, the recipes, or any actions you take as a result of the information provided by the App. You use the App and follow its instructions entirely at your own risk.\n\n3. No Right to Sue\nBy using Cookly, you agree to indemnify and hold harmless Avery442 from any claims, actions, or lawsuits that may arise from your use of the App. This includes any claims related to health issues, damages, or any other consequences that result from following recipes or instructions provided by Cookly.\n\nIf you proceed to use the App or bypass this Terms of Service screen without agreeing to these Terms, you acknowledge that you are waiving any future rights to bring a lawsuit, claim, or legal action against Avery442 for any issues that occur during or after your use of Cookly.\n\n4. Modification of Terms\nWe reserve the right to modify, update, or change these Terms at any time. All updates will be posted on this page with an updated effective date. It is your responsibility to review these Terms periodically for any changes.\n\n5. Termination\nWe reserve the right to suspend or terminate your access to the App at any time, with or without cause, for any reason, including but not limited to, violations of these Terms.\n\n6. Governing Law\nThese Terms shall be governed by and construed in accordance with the laws of the jurisdiction in which Avery442 operates, without regard to its conflict of law principles.\n\n7. Contact Information\nIf you have any questions or concerns about these Terms, please contact us at: Email: [Insert email address] Address: [Insert physical address, if applicable].\n\nBy using Cookly, you acknowledge that you have read, understood, and agree to these Terms of Service."
}
  